'''Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:

сторона_а (довжина сторони a).
кут_а (кут між сторонами a і b).
кут_б (суміжний з кутом кут_а).
Необхідно реалізувати наступні вимоги:

Значення сторони сторона_а повинно бути більше 0.
Кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, значення кут_б обчислюється автоматично.
Для встановлення значень атрибутів використовуйте метод __setattr__.'''

class Ромб:
    def __init__(self, сторона_а, кут_а):
        self.сторона_а = сторона_а
        self.кут_а = кут_а

    def __str__(self):
        return f"Сторона: {self.сторона_а}, Кут A: {self.кут_а}, Кут Б: {self.кут_б}"

    def __setattr__(self, key, value):
        if key == 'сторона_а':
            if value <= 0:
                print("Сторона повинна бути більше 0")
                return
            super().__setattr__(key, value)

        elif key == 'кут_а':
            if not (0 < value < 180):
                print("Кут повинен бути в діапазоні (0, 180)")
                return
            super().__setattr__('кут_а', value)
            super().__setattr__('кут_б', 180 - value)

        else:
            super().__setattr__(key, value)  # Поставил если вдруг нужно будет вписать кут_б или глвую переменную


ромб = Ромб(сторона_а=1, кут_а=40)
print(ромб)